[
  {
    "number": "Surah Ar-Rahman (55:13)",
    "ayah": "So which of the favors of your Lord would you deny?"
  },
  {
    "number": "Surah Al-Baqarah (2:129)",
    "ayah": "Our Lord, and send among them a messenger from themselves who will recite to them Your verses and teach them the Book and wisdom and purify them. Indeed, You are the Exalted in Might, the Wise."
  },
  {
    "number": "Surah Al-A'raf (7:156)",
    "ayah": "But My mercy encompasses all things. So I will decree it [especially] for those who fear Me and give zakah and those who believe in Our verses."
  },
  {
    "number": "Surah Ash-Sharh (94:5-6)",
    "ayah": "For indeed, with hardship [will be] ease. Indeed, with hardship [will be] ease."
  },
  {
    "number": "Surah Al-Baqarah (2:286)",
    "ayah": "Allah does not burden a soul beyond that it can bear..."
  },
  {
    "number": "Surah Hud (11:88)",
    "ayah": "He said, 'O my people, have you considered: if I should be upon clear evidence from my Lord and He has provided me with a good provision from Him, and I do not intend to differ from you in that which I have forbidden you; I only intend reform as much as I am able. And my success is not but through Allah. Upon him I have relied, and to Him I return.'"
  },
  {
    "number": "Surah Al-Baqarah (2:129)",
    "ayah": "Our Lord, and send among them a messenger from themselves who will recite to them Your verses and teach them the Book and wisdom and purify them. Indeed, You are the Exalted in Might, the Wise."
  },
  {
    "number": "Surah An-Nisa (4:36)",
    "ayah": "Worship Allah and associate nothing with Him, and to parents do good, and to relatives, orphans, the needy, the near neighbor, the neighbor farther away, the companion at your side, the traveler, and those whom your right hands possess. Indeed, Allah does not like those who are self-deluding and boastful."
  },
  {
    "number": "Surah Al-Mumtahanah (60:8)",
    "ayah": "Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes - from being righteous toward them and acting justly toward them. Indeed, Allah loves those who act justly."
  },
  {
    "number": "Surah Al-Isra (17:23)",
    "ayah": "And your Lord has decreed that you not worship except Him, and to parents, good treatment. Whether one or both of them reach old age [while] with you, say not to them [so much as], 'uff,' and do not repel them but speak to them a noble word."
  }
  ]